import string, math

# Task 1
# Напишіть скрипт, який порахує скільки літер «b» у введеному рядку тексту.
#print(input("text: >>> ").count("b"))
#-------------------------------------------------------------------------------------------------------------------

# Task 2
# Користувач вводить з клавіатури ім'я людини.
# Написати програму для перевірки введеного ім'я на валідність (мається на увазі, що, наприклад, в імені людини
# не може бути цифр, воно повинно починатися з великої літери, за якою повинні йти маленькі).
# name = input("name: >>> ")
# for i in name:
#     if i.isdigit():
#         name = name.replace(i, "")
# print(name.capitalize())
#-------------------------------------------------------------------------------------------------------------------

# Task 3
# Напишіть скрипт, який обчислює суму всіх кодів символів рядка.
# s = list(map(ord, input("text: >>> ")))
# print(sum(s))
#-------------------------------------------------------------------------------------------------------------------

# Task 4
# Виведіть на екран 10 рядків із значенням числа Pi.
# У першому рядку має бути 2 знаки після коми, у другому 3 і так далі.
# for i in range(10):
#     print(str(math.pi)[:i+4])
#------------------------------------------------------------------------------------------------------------------

# Task 5
# Вводиться з клавіатури користувачем текст. Знайти в ньому найдовше слово та вивести його на екран.
# text = max(input("text : >>> ").split(), key=len)
# print(text)
#------------------------------------------------------------------------------------------------------------------

# Task 6
# Вовочка, сидячи на уроці, писав поспіль однакові слова (слово може складатися з однієї літери).
# Коли Марія Іванівна забрала у нього зошит, там був один рядок тексту.
# Напишіть програму, яка визначить найкоротше слово з написаних Вовочкою. Наприклад:
# aaaaaaa - Вовочка писав слово - "a"
# ititititit - Вовочка писав слово - "it"
# catcatcatcat - Вовочка писав слово - "cat"

#------------------------------------------------------------------------------------------------------------------

# Task 7
# Напишіть скрипт для очищення тексту від HTML-тегів.
# Також необхідно врахувати кілька особливостей:
# - крім одинарних тегів є парні теги, наприклад <div> </div>,
# тобто. перший тег відкриває, а другий закриває.
# - тег у собі може містити купу додаткової інформації.
# Наприклад <div id="rcnt" style="clear:both;position:relative;zoom:1">
# text = input("text: >>> ")
# while True:
#     if "<" in text:
#         start = text.index("<")
#         end = text.index(">")
#         text = text[: start] + text[end+1:]
#     else:
#         break
# print(text)
#--------------------------------------------------------------------------------------------------------------------