# Task 1
# Є дев'ятиповерховий будинок, в якому 4 під'їзди.
# Номер під'їзду починається з одиниці. На одному поверсі - 4 квартири.'
# ' Напишіть програму, яка від користувача отримує номер квартири та виводить для заданої квартири номер під'їзду,
# поверху та номер на поверсі. Якщо такої квартира немає в цьому будинку, то необхідно повідомити користувача про це.
#
# flat = int(input("enter flat please ?: >>> "))
# if flat % 36 == 0:
#     flat -= 1
# entrance = flat // 36 + 1
# floor = flat // 4 + 1
# if flat <= 0 or 144 < flat:
#     print("invalid enter")
# else:
#     if entrance >= 2:
#         floor = (flat - 36 * (entrance - 1)) // 4 + 1
#     print(f'your flat is located in {entrance} entrance\nand {floor} floor')
#--------------------------------------------------------------------------------------------------------------------

# Task 2
# Написати програму, яка буде повертати для заданого року кількість днів.
# Рік є високосним, якщо він кратний 4, але не кратний 100, а також якщо він кратний 400
# year = int(input("Enter year please ?: >>> "))
# if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
#     print('leap year')
# else:
#     print("not leap year")
#--------------------------------------------------------------------------------------------------------------------

# Task 3
# Трикутник існує лише тоді, коли сума будь-яких двох сторін більше третьої.
# Дано: A, B, C - сторони трикутника. Напишіть програму, яка вказує чи існує такий трикутник.
# print("sizes: ")
# a = float(input("a = "))
# b = float(input("b = "))
# c = float(input("c = "))
#
# if a == 0 or b == 0 or c == 0:
#     print("the one of size is error")
# elif a + b > c and a + c > b and b + c > a:
#     print("it is triangle")
# else:
#     print("it is not triangle")
#---------------------------------------------------------------------------------------------------------------------

# Task 1
# Попросіть користувача ввести пароль.
# Якщо введений пароль співпадає з певним заздалегідь заданим паролем,
# вивести "Доступ дозволено", інакше - "Доступ заборонено".
# passw = input("enter password please: >>> ")
# password = 'password'
# print("access is allowed") if passw == password else print('access is denied')
#--------------------------------------------------------------------------------------------------------------------

# Task 2
# Попросіть користувача ввести суму покупки.
# Якщо сума перевищує 1000 гривень, застосуйте знижку у розмірі 10% і виведіть загальну суму до сплати.
# summ = float(input("enter summ: >>> "))
# print(summ - (summ/100)*10) if summ > 1000 else print(summ)
#-------------------------------------------------------------------------------------------------------------------

# Task 3
# Попросіть користувача ввести номер місяця (1-12).
# Виведіть кількість днів у цьому місяці.
# (Зверніть увагу на високосні роки для лютого.)
# m = int(input("enter mounth: >>> "))
# if m == 1 or m == 3 or m == 5 or m == 7 or m == 8 or m == 10 or m == 12:
#     print("in this mounth 31 days")
# elif m == 2:
#     year = int(input("Enter year please ?: >>> "))
#     if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
#         print('in this mounth 29 days')
#     else:
#         print("in this mounth 28 days")
# else:
#     print("in this mounth 30 days")
#--------------------------------------------------------------------------------------------------------------------

# Task 4
# Попросіть користувача ввести рейтинг обслуговування (від 1 до 5).
# Виведіть відповідне повідомлення про рівень обслуговування
# (наприклад, "Відмінно", "Добре", "Задовільно", "Погано", "Жахливо").
# rating = input('enter rating please: (1-5) >>> ')
# if rating == '5':
#     print("perfect")
# elif rating == '4':
#     print("good")
# elif rating == '3':
#     print("passably")
# elif rating == '2':
#     print("bad")
# elif rating == '1':
#     print("very bad")
# else:
#     print('error, rating not in 1-5')
#--------------------------------------------------------------------------------------------------------------------

# Task 5
# Попросіть користувача ввести свою вагу (в кілограмах) та зріст (в метрах).
#  Обчисліть і виведіть індекс маси тіла (BMI) за формулою: BMI = вага / (зріст^2).
# Далі виведіть відповідне повідомлення про стан ваги
# (наприклад, "Недостатньо ваги", "Нормальна вага", "Надлишкова вага", "Ожиріння").
# m = float(input('enter weight: >>> '))
# h = float(input('enter height (centimeters): >>> '))/100
# index = round(m / h**2)
# print(h)
# print('індекс маси тіла = ', index)
#
# if 16 <= index <= 18.5:
#     print('недостатня вага')
# elif 18.6 <= index <= 24.99:
#     print("вага в нормі")
# elif 25 <= index <= 30:
#     print("надмірна вага (передожиріння)")
# elif 31 <= index:
#     print("ожиріння")
#--------------------------------------------------------------------------------------------------------------------

