# Task_1
# print("Число від'ємне!" if int(input("Введіть число: >>> ")) < 0 else "Число не від'ємне!")

# Task_2
# n = int(input("Введіть число: >>> ")) # варінт_1
# print(n < 20)
#
# print("Введене начення більше 20" if n > 20 else "Значення меньше 20") # варінт_2

# Task_3
# if_zero = int(input("Введіть число: >>> "))
# print(if_zero == 0)

# Task_4
# if_even = int(input("Введіть число: >>> "))
# print(if_even % 2 == 0)

# Task_5
# n1 = int(input("Введіть перше число: >>> ")) # варіант_1
# n2 = int(input("Введіть друге число: >>> "))
# n3 = int(input("Введіть третє число: >>> "))
# print("Найбільше введене число :", max(n1, n2, n3))
#
# if n1 > n2 > n3: # варіант_2
# print("Найбільше число: ", n1)
# elif n2 > n3:
# print("Найбільше число: ", n2)
# else:
# print("Найбільше число: ", n3)

# Task_6
# answer = input("Чи є у вас водійське посвідчення? (т/н): ")
# if answer == "т":
# print("Ви можете керувати авто")
# elif answer == "н":
# print("Ви не можете керувати авто")

# Task_7
# answer = int(input("Вкажіть ваш вік?: "))
# if answer >= 18:
# print("Ви можете отримати посвідення водія")
# else:
# print("Ви не відповідаєте критеріям для отримання посвідчення водія")

# Task_7
# answer = int(input("Вкажіть число?: "))
# if answer > 0 and answer % 2 == 0:
# print("число є додатнім і парним")
# else:
# print("Ваше число не відповідає критеріям")

# Task_8
# answer = int(input("Вкажіть число?: "))
# if answer % 3 == 0 and not answer % 5 == 0:
# print("число підходить")
# else:
# print("Ваше число не підходить")