import string

# Task 1
# Напишіть програму, яка приймає рядок тексту і повертає словник, де ключами є слова,
# а значеннями - кількість входжень кожного слова в тексті.
# text = input("text: >>> ").split()
# c = {}
# for item in text:
#     c[item] = text.count(item)
# варіант 2
# print({item: text.count(item) for item in text})
#-------------------------------------------------------------------------------------------------------------------

# Task 2
# Реалізуйте простий перекладач, який використовує словник для збереження пар слів.
# Користувач може вводити слово, а програма повертає його переклад.
# У цьому випадку, словник може використовуватись для збереження відповідностей між словами у різних мовах.
#
# translations = {
#      'hello': 'привіт',
#      'goodbye': 'до побачення',
#      'cat': 'кіт',
#      'dog': 'собака'
# }
# my_text = "Hello, cat. Goodbye, dog".split()
# ind = 0
# for i in my_text:
#     i = i.lower().strip(string.punctuation)
#     my_text[ind] = i
#     #ind +=1
#     if i in translations.keys():
#         my_text[ind] = translations.get(i)
#         ind += 1
# print(*my_text)
# ------------------------------------------------------------------------------------------------------------------

# Task 3
# Реалізуйте просту програму для збереження контактів.
# Кожен контакт може мати ім'я як ключ та номер телефону як значення.
# Дозвольте користувачу додавати нові контакти, видаляти існуючі та отримувати номер телефону за ім'ям.
# note = {
#     'user_1': '0951111111',
#     'user_2': '0952222222',
#     'user_3': '0953333333'
# }
# enter = input("Для додавання нового контакту натисніть: 1\nдля видялення контакту натисніть:        2\
#                \nдля отримання номеру телефону натисніть: 3\nдля виходу натисніть: 4\nзробіть вибір: >>> ")
# if enter == '1':
#     user = input("Введіть нового користувача: >>> ")
#     tel = input("Введіть номер телефону: >>> ")
#     note[user] = tel
#     print("Користувач успішно доданий")
# elif enter == '2':
#     user_del = input("якого користувача видалити? >>> ")
#     if user_del in note:
#         del note[user_del]
#         print(f"дані користувача {user_del} видалено")
#     else:
#         print("такого користувача не має в базі")
# elif enter == '3':
#     who = input("ведіть користувача для отримання даних: >>> ")
#     if who in note:
#         print(f"користувач: {who}\nтелефон: {note[who]}")
#     else:
#         print("такого користувача не має в базі")
# elif enter == '4':
#     exit()
# else:
#     print("помилка вводу!")
#------------------------------------------------------------------------------------------------------------------

# Task 4
# Напишіть програму, яка конвертуватиме суму з однієї валюти в іншу, використовуючи словник з курсами обміну.
# change = {
#     "usd": 41,
#     "eur": 44,
#     "pln": 10.3,
#     "uah": 1
# }
# money = input("Введіть валюту з якої потрібно конвертувати? (usd, eur, pln, uah) \n>>> ")
# if money in change.keys():
#     how_much = int(input("кількість ?: "))
#     to_money = input("у яку валюту?: ")
#     kurs = change.get(money) * how_much / change.get(to_money)
#     print(round(kurs, 2))
# else:
#     print("некоректний ввод")
#--------------------------------------------------------------------------------------------------------------------