import random

# Task 1
# Напишіть скрипт, який виводить на екран усі числа в діапазоні від 1 до 100 кратні 7.
# n = [i for i in range(1, 101) if i % 7 == 0]
# print(n)
#-------------------------------------------------------------------------------------------------------------------

# Task 2
# Напишіть скрипт для визначення суми цілих непарних чисел від 1 до 99 за допомогою оператора for.
# Використовуйте цілочисельні змінні summa і count.
# summa = 0
# for count in range(1, 100):
#     if count % 2 != 0:
#         summa = summa + count
# print(summa)
#-------------------------------------------------------------------------------------------------------------------

# Task 3
# Напишіть скрипт, який виводить цілі числа від 1 до 200, використовуючи цикл while.
# В одному рядку необхідно виведити лише п’ять цілих чисел.
# Наприклад,
# 1 2 3 4 5
# 6 7 8 9 10
# 11 12 13 14 15
# ...
# count, number = 0, 1
# while number <= 200:
#     print(number, end=" ")
#     number = number + 1
#     count = count + 1
#     if count % 5 == 0:
#         print()
#-------------------------------------------------------------------------------------------------------------------

# Task 4
# Напишіть скрипт, який обчислює за допомогою циклу факторіал числа n (n вводиться з клавіатури).
# f = int(input("n= "))
# factorial = 1
# for i in range(1, f+1):
#     factorial = factorial * i
# print(factorial)
#------------------------------------------------------------------------------------------------------------------

# Task 5
# Напишіть скрипт, який виводить на екран таблицю множення на 5.
# Переважно друкувати 1 x 5 = 5, 2 x 5 = 10, а не просто 5, 10, ...
# for i in range(1, 10):
#     print(f"{i} x 5 = {i*5}")
#------------------------------------------------------------------------------------------------------------------

# Task 6
# Напишіть скрипт, який виводить на екран прямокутник із '*'.
# Висота і ширина прямокутника вводяться з клавіатури.
# Наприклад, нижче представлений прямокутник з висотою 4 та шириною 5.
# *****
# *   *
# *   *
# *****
# weight = int(input("weight: >>> "))
# heigh = int(input("heigh: >>> "))
# print("*" * weight)
# for _ in range(heigh-2):
#     print("*", " " * (weight-4), "*")
# print("*" * weight)
#--------------------------------------------------------------------------------------------------------------------

# Task 7
# Є список [0, 5, 2, 4, 7, 1, 3, 19].
# Напишіть скрипт для підрахунку непарних цифр у ньому.
# count = 0
# for i in [0, 5, 2, 4, 7, 1, 3, 19]:
#     if i % 2 != 0:
#         count += 1
# print(count)
#
# другий варіант скрипта
#print(len([i for i in [0, 5, 2, 4, 7, 1, 3, 19] if i % 2 !=0]))
#--------------------------------------------------------------------------------------------------------------------

# Task 8
# Створіть список випадкових чисел (розміром 4 елементи).
# Створіть другий список у два рази більше першого, де перші 4 елементи повинні дорівнювати елементам першого списку,
# а решта елементів - подвоєним значенням початкових.
# Наприклад,
# Було → [1,4,7,2]
# Стало → [1,4,7,2,2,8,14,4]
# ls = []
# for _ in range(4):
#     ls.append(random.randint(1, 10))
# print(ls + [i*2 for i in ls])
#--------------------------------------------------------------------------------------------------------------------

# Task 9
# Створіть список із 12 елементів. Кожен елемент цього списку є зарплатою робітника за місяць.
# Виведіть цей список на екран та обчисліть середньомісячну зарплату цього робітника.
# salary = [1000, 900, 950, 980, 1200, 1500, 1100, 1120, 1150, 1220, 980, 1150]
# print(round(sum(salary)/12))
#-------------------------------------------------------------------------------------------------------------------

# Task 10
# Є матриця
# [1, 2, 3, 4]
# [5, 6, 7, 8]
# [9, 10, 11, 12]
# [13, 14, 15, 16]
# Напишіть скрипт, який виведе цю матрицю на екран, обчислить та виведе суму елементів цієї матриці.
# ls = [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12], [13, 14, 15, 16]]
# ls_2 = []
# for item in ls:
#     print(item)
#     for i in item:
#         ls_2.append(i)
# print("summa = ", sum(ls_2))
#--------------------------------------------------------------------------------------------------------------------

# Task 11
# Написати код для дзеркального перевороту списку [7,2,9,4] -> [4,9,2,7].
# Список може бути довільною довжиною.
#print(input("enter list: >>> ")[::-1])
#--------------------------------------------------------------------------------------------------------------------

# Task 12
# За допомогою циклів вивести на екран усі прості числа від 1 до 100.
# primes = []
# for j in range(1, 101):
#   is_prime = True
#   for i in range(2, j):
#     if j % i == 0:
#       is_prime = False
#   if is_prime:
#     primes.append(j)
# print(primes)
#--------------------------------------------------------------------------------------------------------------------

# Task 13
# Виведіть на екран «пісочний годинник», максимальна ширина якого зчитується з клавіатури (число непарне).
# У прикладі ширина дорівнює 5.
# *****
#  ***
#   *
#  ***
# *****
# weight = int(input("weight? >>> "))
# if weight % 2 == 0:
#     weight +=1
# end = weight
# space = 1
# for _ in range(weight):
#     print("*" * weight)
#     print(" " * space, end="")
#     weight -=2
#     space +=1
#     if weight == 1:
#         break
# space -=2
# for _ in range(end):
#     print("*" * weight)
#     print(" " * space, end="")
#     weight +=2
#     space -=1
#     if weight == end+2:
#         break
#-------------------------------------------------------------------------------------------------------------------

