# Task 1
# Напишіть програму, яка перевіряє, чи всі елементи в списку є унікальними.
# ls = [1, 2, 3, 4, 5, 5, 5, 6, 7]
# ls2 = [1, 2, 3, 4, 5]
# print(len(ls) == len(set(ls)))
# print(len(ls2) == len(set(ls2)))
#--------------------------------------------------------------------------------------------------------------------

# Task 2
# Напишіть програму, яка приймає список елементів і повертає кількість унікальних елементів.
# ls = [1, 2, 3, 4, 5, "a", "aa", True, 123, 2, 3, True, "a"]
# print(list([i for i in ls if ls.count(i) == 1]), len(list([i for i in ls if ls.count(i) == 1])),  "elements")
#-------------------------------------------------------------------------------------------------------------------
# Task 3
# Напишіть програму, яка приймає словник і перевіряє, чи містяться в ньому унікальні значення.
# d = {
#     "one": 1,
#     "two": 2,
#     "three": 3,
#     "other": 1,
#     "other_2": 2,
#     "other_3": 10
# }
# l = [i for i in d.values()]
# print("унікальне значення: ", *[i for i in l if l.count(i) == 1])
#--------------------------------------------------------------------------------------------------------------------

# Task 4
# Припустимо, що у тебе є дані про дружбу між користувачами соціальної мережі
# Напишіть програму для розрахунку спільних друзів у соціальній мережі, імена яких задає користувач.
# friendships = {
#     "user1": {"user2", "user3", "user4"},
#     "user2": {"user1", "user3"},
#     "user3": {"user1", "user2", "user4"},
#     "user4": {"user1", "user3"}
# }
# friend_1 = input("enter user 1: (user1, user1, user3, user4) >>> ")
# friend_2 = input("enter user 2: (user1, user1, user3, user4) >>> ")
#
# friend_1_friends = [i for i in friendships.get(friend_1)]
# friend_2_friends = [i for i in friendships.get(friend_2)]
#
# print(f"спільні друзі у {friend_1} та {friend_2} це  {set(friend_1_friends) & set(friend_2_friends)}")
#--------------------------------------------------------------------------------------------------------------------

# Task 5
# Напишіть програму, яка повертає найдовше слово, яке міститься одночасно у двох рядках.
# s_1 = set("one two three four twentythree".split())
# s_2 = set("one four five twentythree".split())
# s_3 = s_1.intersection(s_2)
# print(sorted(list(s_3), key=len)[-1])
#--------------------------------------------------------------------------------------------------------------------