# Task 1
# Дано число (чотиризначне). Перевірити, чи воно є «щасливим квитком».
# Примітка: щасливим квитком називається число, у якому, при парній кількості цифр,
# сума цифр його лівої половини дорівнює сумі цифр його правої половини.
# Наприклад, 1322 є щасливим квитком, тому що 1 + 3 = 2 + 2
# number = input('number? : >>> ')
# number_1 = list(number[: len(number)//2])
# number_2 = list(number[len(number)//2:])
#
# if len(number) % 2 == 0:
#     if sum(map(int, number_1)) == sum(map(int, number_2)):
#         print("the ticket is heppy")
#     else:
#         print("the ticket is not heppy")
# else:
#     print("odd number of digits")
#-------------------------------------------------------------------------------------------------------------------

# Task 2
# З клавіатури вводиться число (шестизначне). Перевірити, чи воно є паліндромом.
# Примітка: Паліндром називається число, слово або текст, які однаково читаються зліва направо і справа наліво.
# Наприклад, це числа 143341, 5555, 7117 і т.д.
# n = input("enter number: >>> ")
# print(f'{n[:] == n[::-1]}')
#------------------------------------------------------------------------------------------------------------------

# Task 3
# Дано коло з центром на початку координат та радіусом 4.
# Користувач вводить з клавіатури координати точки x та y.
# Написати програму, яка визначить, лежить ця точка всередині кола чи ні.
# x = int(input("enter x: >>> "))
# y = int(input("enter y: >>> "))
# R = 4
# print(f"{x**2 + y**2 <= R**2}")
#------------------------------------------------------------------------------------------------------------------